# Pandas Serisi Oluşturma

In [1]:
import pandas as pd

In [2]:
seri = pd.Series([10,2,3,5,6])

In [3]:
type(seri)

pandas.core.series.Series

In [4]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [5]:
seri.dtype

dtype('int64')

In [6]:
seri.ndim

1

In [7]:
seri.size

5

In [8]:
seri.values

array([10,  2,  3,  5,  6], dtype=int64)

In [9]:
seri.head(3)

0    10
1     2
2     3
dtype: int64

In [10]:
seri.tail(3)

2    3
3    5
4    6
dtype: int64

In [11]:
pd.Series([99,45,87,45,63])

0    99
1    45
2    87
3    45
4    63
dtype: int64

In [12]:
seri  = pd.Series([99,45,87,45,63],index=["Ali","Osman","d","s","f"])

In [13]:
seri["s"]

45

In [14]:
#Sözlük üzerinden list

In [15]:
sozluk = pd.Series({"reg":10,"log":11,"cart":12})

In [16]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [17]:
#iki seriyi birleştirerek oluştur.

In [18]:
pd.concat([seri,seri])

Ali      99
Osman    45
d        87
s        45
f        63
Ali      99
Osman    45
d        87
s        45
f        63
dtype: int64

# Eleman işlemleri

In [19]:
import numpy as np

In [20]:
a = np.array([1,2,33,444,75])

In [21]:
seri = pd.Series(a)

In [22]:
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [23]:
seri[0]

1

In [24]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [25]:
seri = pd.Series([121,200,150,99],index=["reg","loj","cart","rf"])

In [26]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [27]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [28]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [29]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [30]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [31]:
# eleman sorgula

In [32]:
"reg" in seri

True

In [33]:
#fancy index

In [34]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [35]:
seri["reg"] = 13

In [36]:
seri

reg      13
loj     200
cart    150
rf       99
dtype: int64

In [37]:
seri["reg":"loj"]

reg     13
loj    200
dtype: int64

# Pandas data frame oluşturma

In [38]:
l = [1,2,39,67,90]

In [39]:
l

[1, 2, 39, 67, 90]

In [40]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [41]:
m = np.arange(1,10).reshape((3,3))

In [42]:
pd.DataFrame(m,columns=["var_1","var_2","var_3"])

   var_1  var_2  var_3
0      1      2      3
1      4      5      6
2      7      8      9

In [43]:
#df isimlendirme

In [44]:
df = pd.DataFrame(m,columns=["var_1","var_2","var_3"])

In [45]:
df.head()

   var_1  var_2  var_3
0      1      2      3
1      4      5      6
2      7      8      9

In [46]:
df.columns = ("deg_1","deg_2","deg_3")

In [47]:
df

   deg_1  deg_2  deg_3
0      1      2      3
1      4      5      6
2      7      8      9

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg_1', 'deg_2', 'deg_3'], dtype='object')]

In [50]:
df.shape

(3, 3)

In [51]:
df.ndim

2

In [52]:
df.size

9

In [53]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [54]:
type(df.values)

numpy.ndarray

In [55]:
df.head()

   deg_1  deg_2  deg_3
0      1      2      3
1      4      5      6
2      7      8      9

In [56]:
df.tail(1)

   deg_1  deg_2  deg_3
2      7      8      9

In [57]:
a = np.array([1,2,3,4,5])

In [58]:
pd.DataFrame(a,columns=["deg_1"])

   deg_1
0      1
1      2
2      3
3      4
4      5

# Eleman İşlemleri

In [59]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [60]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [61]:
df = pd.DataFrame(sozluk)

In [62]:
df

   var1  var2  var3
0     1     3     5
1     3     2     7
2     7     8     7
3     6     7     8
4     4     0     1

In [63]:
df[0:1]

   var1  var2  var3
0     1     3     5

In [64]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [65]:
df.index =["a","b","c","d","e"]

In [66]:
df

   var1  var2  var3
a     1     3     5
b     3     2     7
c     7     8     7
d     6     7     8
e     4     0     1

In [67]:
df["c":"e"]

   var1  var2  var3
c     7     8     7
d     6     7     8
e     4     0     1

In [68]:
#silme

In [69]:
df.drop("a",axis=0,inplace=True)

In [70]:
df

   var1  var2  var3
b     3     2     7
c     7     8     7
d     6     7     8
e     4     0     1

In [71]:
#fancy ile drop

In [72]:
l = ["c","e"]

In [73]:
df.drop(l,axis=0)

   var1  var2  var3
b     3     2     7
d     6     7     8

In [74]:
#değişkenler için

In [75]:
"var1"in df

True

In [76]:
l = ["var1","var4","var2"]

In [77]:
for i in l:
    print(i in df)

True
False
True

In [78]:
df

   var1  var2  var3
b     3     2     7
c     7     8     7
d     6     7     8
e     4     0     1

In [79]:
df["var1"]

b    3
c    7
d    6
e    4
Name: var1, dtype: int32

In [80]:
df["var4"] = df["var1"]/df["var2"]

In [81]:
df

   var1  var2  var3      var4
b     3     2     7  1.500000
c     7     8     7  0.875000
d     6     7     8  0.857143
e     4     0     1       inf

In [82]:
#değişken silmek

In [83]:
df.drop("var4",axis=1,inplace=True)

In [84]:
df

   var1  var2  var3
b     3     2     7
c     7     8     7
d     6     7     8
e     4     0     1

In [85]:
l = ["var1","var2"]

In [86]:
df.drop(l,axis=1)

   var3
b     7
c     7
d     8
e     1

# gözlem ve değişken seçimi

In [87]:
import pandas as pd
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    21    20     6
1    10    21    24
2    11    27     5
3     2    17    27
4    11     6    11
5    24     8     1
6    19    17     6
7     6    11    22
8    28    17    14
9    19    28     9

In [88]:
#loc:tanımladıığ şekliyle seçim yapmak için kullanılır

In [89]:
df.loc[0:3]

   var1  var2  var3
0    21    20     6
1    10    21    24
2    11    27     5
3     2    17    27

In [90]:
#iloc : Alışık olduğumuz indeksleme mantğıyla seçim yapar

In [91]:
df.iloc[0:3]

   var1  var2  var3
0    21    20     6
1    10    21    24
2    11    27     5

In [92]:
df.iloc[0,0]

21

In [93]:
df

   var1  var2  var3
0    21    20     6
1    10    21    24
2    11    27     5
3     2    17    27
4    11     6    11
5    24     8     1
6    19    17     6
7     6    11    22
8    28    17    14
9    19    28     9

In [94]:
df.iloc[:3,:2]

   var1  var2
0    21    20
1    10    21
2    11    27

In [95]:
df.loc[0:3,"var3"]

0     6
1    24
2     5
3    27
Name: var3, dtype: int32

In [96]:
df.loc[0:3,"var3"]

0     6
1    24
2     5
3    27
Name: var3, dtype: int32

In [97]:
df.iloc[0:3]["var3"]

0     6
1    24
2     5
Name: var3, dtype: int32

# Koşullı eleman işlemleri

In [98]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])

In [99]:
df[df.var1>15]["var1"]

0    16
1    24
3    19
4    21
6    29
8    29
Name: var1, dtype: int32

In [100]:
df[(df.var1>15) & (df.var3)<5]

   var1  var2  var3
0    16    15    27
1    24     3    14
2    14    24    29
3    19    17    13
4    21     1     1
5    12     1     9
6    29    23     2
7    10    18     3
8    29    15    27
9     9    19    10

In [101]:
df.loc[df.var1>15,["var1","var2"]]

   var1  var2
0    16    15
1    24     3
3    19    17
4    21     1
6    29    23
8    29    15

# Birleştirme İşlemleri

In [102]:
m = np.random.randint(1,30,size=(5,3))
df1 = pd.DataFrame(m,columns = ["var1","var2","var3"])

In [103]:
df2 = df1 +99

In [104]:
pd.concat([df1,df2])

   var1  var2  var3
0     5    13     5
1     2    14    17
2     2    15    17
3    26     9    18
4    16    12    22
0   104   112   104
1   101   113   116
2   101   114   116
3   125   108   117
4   115   111   121

In [105]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0     5    13     5
1     2    14    17
2     2    15    17
3    26     9    18
4    16    12    22
5   104   112   104
6   101   113   116
7   101   114   116
8   125   108   117
9   115   111   121

In [106]:
df1.columns=["deq1","var1","var2"]

In [107]:
df2.columns  = ["var1","var2","var3"]

In [108]:
pd.concat([df1,df2])

   deq1  var1  var2   var3
0   5.0    13     5    NaN
1   2.0    14    17    NaN
2   2.0    15    17    NaN
3  26.0     9    18    NaN
4  16.0    12    22    NaN
0   NaN   104   112  104.0
1   NaN   101   113  116.0
2   NaN   101   114  116.0
3   NaN   125   108  117.0
4   NaN   115   111  121.0

# İLERİ BİRLEŞTİRME İŞLEMLERİ

In [109]:
import pandas as pd

In [110]:
df1 = pd.DataFrame({'calisanlar':["Ayse","Ali","Veli","Fatma"],
'grup':['Muhasebe',"Muhendislik","Muhendislik","İK"]})
df2 = pd.DataFrame({'calisanlar':["Ayse","Ali","Veli","Fatma"],'ilk_giris':[2010,2009,2014,2019]})

In [111]:
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [112]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [113]:
#coktan teke

In [114]:
df3 = pd.merge(df1,df2)

In [115]:
df3

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [116]:
df4 = pd.DataFrame({'grup':['Muhasbe',"Muhendislik","İK"],
'mudur':["Caner","Mustafa","Berkcan"]})

In [117]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali  Muhendislik       2009  Mustafa
1       Veli  Muhendislik       2014  Mustafa
2      Fatma           İK       2019  Berkcan

# Toplulaştırma ve gruplama
* count
* first 
* last
* mean 
* median
* min 
* max
* std 
* var
* sum

In [118]:
import seaborn as sns

In [119]:
df = sns.load_dataset("planets")

In [120]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [121]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [122]:
df.shape

(1035, 6)

In [123]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [124]:

df.mean()

C:\Users\S_05_\AppData\Local\Temp\ipykernel_6800\779901321.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [125]:

df["mass"].mean()

2.6381605847953216

In [126]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [127]:
df.min()

method            Astrometry
number                     1
orbital_period      0.090706
mass                  0.0036
distance                1.35
year                    1989
dtype: object

In [128]:
df.max()

method            Transit Timing Variations
number                                    7
orbital_period                     730000.0
mass                                   25.0
distance                             8500.0
year                                   2014
dtype: object

In [129]:
df.std()

C:\Users\S_05_\AppData\Local\Temp\ipykernel_6800\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

number                1.240976
orbital_period    26014.728304
mass                  3.818617
distance            733.116493
year                  3.972567
dtype: float64

In [130]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [131]:
df.dropna()

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [132]:
df.isna()

      method  number  orbital_period   mass  distance   year
0      False   False           False  False     False  False
1      False   False           False  False     False  False
2      False   False           False  False     False  False
3      False   False           False  False     False  False
4      False   False           False  False     False  False
...      ...     ...             ...    ...       ...    ...
1030   False   False           False   True     False  False
1031   False   False           False   True     False  False
1032   False   False           False   True     False  False
1033   False   False           False   True     False  False
1034   False   False           False   True     False  False

[1035 rows x 6 columns]

# Gruplama işlemleri

In [133]:
df = pd.DataFrame({'gruplar':['a','b',"c","a","b","c"],
'veri':[10,11,52,23,43,55]},columns=["gruplar","veri"])

In [134]:
df

  gruplar  veri
0       a    10
1       b    11
2       c    52
3       a    23
4       b    43
5       c    55

In [135]:
df.groupby("gruplar")

In [136]:
df.groupby("gruplar").sum()

         veri
gruplar
a          33
b          54
c         107

In [137]:
df.groupby("gruplar").mean()

         veri
gruplar
a        16.5
b        27.0
c        53.5

In [138]:
df = sns.load_dataset("planets")

In [139]:
df.groupby("method")

In [140]:
df.groupby("method")["orbital_period"]

In [141]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [142]:
df.groupby("method")["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [143]:

df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# ileri toplulaştırma- Aggregate

In [144]:
import pandas as pd
df = pd.DataFrame({'gruplar':["a","b","c","a","b","c"],
                    'degisken1':[10,23,33,22,11,99],
                    "degisken2":[100,253,333,262,111,969]},columns=['gruplar','degisken1','degisken2'])

In [145]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [146]:
# aggregate

In [147]:
df.groupby("gruplar")

In [148]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
a             16.0      181.0
b             17.0      182.0
c             66.0      651.0

In [149]:
import numpy as np
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
a              10   16.0  22       100  181.0  262
b              11   17.0  23       111  182.0  253
c              33   66.0  99       333  651.0  969

In [150]:
df.groupby("gruplar").aggregate([min,np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
a              10   16.0  22       100  181.0  262
b              11   17.0  23       111  182.0  253
c              33   66.0  99       333  651.0  969

In [151]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
a               10        262
b               11        253
c               33        969

# FİLTER

In [152]:
import pandas as pd
df = pd.DataFrame({'gruplar':["a","b","c","a","b","c"],
                    'degisken1':[10,23,33,22,11,99],
                    "degisken2":[100,253,333,262,111,969]},columns=['gruplar','degisken1','degisken2'])

In [153]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [ ]:
def filter_func(x):
    return x["degisken1"].std()>9

In [ ]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        969

In [ ]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
a         8.485281  114.551299
b         8.485281  100.409163
c        46.669048  449.719913

# transform

In [ ]:
import pandas as pd
df = pd.DataFrame({'gruplar':["a","b","c","a","b","c"],
                    'degisken1':[10,23,33,22,11,99],
                    "degisken2":[100,253,333,262,111,969]},columns=['gruplar','degisken1','degisken2'])

In [154]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [155]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [157]:
df_a = df.iloc[:,1:3]

In [161]:
df_a.transform(lambda x: (x-x.mean())/x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

# APPLY

In [168]:
import pandas as pd
df = pd.DataFrame({'gruplar':["a","b","c","a","b","c"],
                    'degisken1':[10,23,33,22,11,99],
                    "degisken2":[100,253,333,262,111,969]},columns=['gruplar','degisken1','degisken2'])

In [169]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [170]:
df.apply(np.sum)

gruplar      abcabc
degisken1       198
degisken2      2028
dtype: object

# Pivot Tablolar

In [172]:
import seaborn as snb

In [173]:
titanic = sns.load_dataset("titanic")

In [174]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [175]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [180]:
titanic.groupby(["sex","class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [181]:
# pivot ile table

In [182]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [183]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [184]:
age = pd.cut(titanic["age"],[0,18,90,])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [185]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663